---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependency
source: html/692c9351-8878-b3b3-93b4-b03ddcbc6b08.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.CircularDependency Property

There is a circular chain of references among the highlighted elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId CircularDependency { get; }
```